Revit 2024 API
VoltageTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual VoltageTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As VoltageTypeSetIterator
Visual C++
public:
virtual VoltageTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace